# Задача 30: Требуется найти N-е число Фибоначчи
# a0, a1, ..., an.., где a0 = 0, a1 = 1, ak = ak-1 + ak-2 (k > 1).
#   n = 0  1  2  3  4  5  6   7
# n_f = 1, 1, 2, 3, 5, 8, 13, 21 ...

def n_fib(n):
    if n in (0, 1):
        return 1
    return n_fib(n - 1) + n_fib(n - 2)

n_f = int(input("Введите число N: "))
print("Число Фибоначчи:" , n_fib(n_f))